app/controllers/anteproyectos_controller.rb

  def index
    @anteproyectos = Anteproyecto.all
---
SELECT "anteproyectos".* FROM "anteproyectos"

  def create
    @anteproyecto = Anteproyecto.new(anteproyecto_params)

    respond_to do |format|
      if @anteproyecto.save
---
INSERT INTO "anteproyectos" ("nombre", "objetivo", "justificacion", "cronograma", "descripcionactividad", "nombreempresa", "direccionempresa", "telefonoempresa", "estatus", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_anteproyecto
      @anteproyecto = Anteproyecto.find(params[:id])
---
SELECT  "anteproyectos".* FROM "anteproyectos" WHERE "anteproyectos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]